gradle/WSCxf/WSClient/src/main/resources/testmsg/test_dnic.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soap:mustUnderstand="1"><wsse:UsernameToken wsu:Id="UsernameToken-1"><wsse:Username>pepe</wsse:Username><wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">pWNMBFbz0iPr/5GZlf89/6YeUDg=</wsse:Password><wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">u2907zSiIZt6oDTIgzbQHg==</wsse:Nonce><wsu:Created>2013-01-12T00:20:49.650Z</wsu:Created></wsse:UsernameToken></wsse:Security></soap:Header><soap:Body><ns2:consultarDatos xmlns:ns2="http://dnic.serv.externo.red.uy/"><documento><nro_documento>1234567</nro_documento><pais_documento>UY</pais_documento><tipo_documento>DO</tipo_documento></documento></ns2:consultarDatos></soap:Body></soap:Envelope>